SIMISA@@@@@@@@@@JINX0D0t______

Wagon ( DEE_S15_30840-D06
comment ( New Model by Danny Gilbert )  
comment ( Copyright 2011 )

Type ( Engine )
WagonShape ( DEE_S15_30840.s )
Name ( "DEE_S15_30840 discs 06" )

Include ( ..\\Common_Locomotives\\SR_S15_wagon.inc )


Comment ( ******************** Freight and Load Animations (If used) ********************
                Included in this section - Freight Animation information, etc
          *********************************************************************** )

ORTSFreightAnims (

FreightAnimStatic (
SubType( Default )
Shape ( "..\\common.headcodes\\S15headcodediscs-06.s" )
Offset( 0 0 0 ) )

FreightAnimStatic (
SubType( Default )
Shape ( "8F.s" )
Offset( 0 0 9.2 ) )

)

)


Engine ( DEE_S15_30840

Include ( ..\\Common_Locomotives\\SR_S15_engine.inc )

Description ("There were 45 locomotives in the S15 class. Designed by Urie but later modified by Maunsell, the first batch was completed between 1920-21 (BR numbers 30496-30515), the second batch in 1927-28 (30823-30840) and the third batch in 1936 (30838-30847)"

 "Origin S. R. introduced 1922, A versatile and successful medium power engine.\n\n"+ 
 "Typically used for a wide variety of freight and passenger duties.\n\n"+
 "Locomotive type & no.: BR ex. SR 4-6-0 No. 30840\n\n"+
 "Power source: 200 psi hand-fired, coal burning boiler\n\n"+
 "Wheel configuration: Six 79 in. (2.01 m) diameter driving wheels in a 4-6-0 configuration\n\n"+
 "Max. speed: 95 mph (152.95 km/h) under favorable conditions\n\n"+
 "Height: 12 ft. 11½ in. (3.95 m)\n\n"+
 "Width: 9 ft. 0 in. (2.74 m) (over cylinders)\n\n"+
 "Length (locomotive & tender): 64 ft. 7½ in. (19.7m)\n\n"+
 "Weight (locomotive & tender):136.45 tons\n\n"+
 "Tractive effort: 23,900 lb (10,841 kg)\n\n"+
 "Coal capacity: 5.0 tons\n\n"+
 "Water capacity: 5,000 gallons (18,926 liters)\n\n"+
 "Brakes: Vacuum\n\n" 
)
EngineOperatingProcedures (
"To move forward\n"+
"1.Press the W key several times to move the Reverser to full Forward.\n"+
"2.Press the ; (SEMICOLON) key to release the train brakes.\n"+
"3.Press the D key to increase the Regulator setting.\n"+  
"4.As you accelerate, press the S key to slowly reduce the Reverser setting, then adjust the Regulator to maintain the desired speed.\n\n"+
"To slow the train\n"+
"1.Press the A key to move the Regulator to a lower setting.\n"+
"2.Use the brakes to further reduce speed if desired.\n\n"+
"To apply the train brakes\n"+
"1.Press the ' (APOSTROPHE) key to apply the train brakes.\n"+
"2. To hold the brakes at their current setting, lower the brake lever until it's in its middle (Neutral) position, by pressing the ; (SEMICOLON) key.\n\n"+
"To release the train brakes\n"+
"1. Press  the ; (SEMICOLON) key to release the train brakes.\n"+
"2. When the brakes are released, raise the brake lever until it's in its middle (Neutral) position, by pressing the ' (APOSTROPHE) key.\n\n"+
"To back up\n"+
"1.Bring your train to a full stop.\n"+ 
"2.Press the S key several times to move the Reverser to the full Reverse position.\n"+
"4.Press the ; (SEMICOLON) key to release the brakes.\n"+
"5.Slowly advance the regulator (D key).\n\n"+
"To load and unload passengers\n"+
"1. Stop at a station.\n"+
"2. Press the ENTER key.\n"+
"3. Wait for the \"permission to depart\" whistle.\n"+
"TIP: Use the Next Station driving aid (F10) to monitor loading and unloading.\n\n"+
"To couple to a car or locomotive\n"+
"1. Coast into the unit at a very slow speed, about 2 mph.\n"+
"TIP: To use the Coupling view, press the 6 key.\n"+
"2. Press F9 to open the Train Operations window.\n"+
"3. If the icon for the unit you coupled to is red, the handbrake is on. Double-click the car to release the handbrake.\n"+
"4. Close the Train Operations window.\n\n"+
"To uncouple from a car or locomotive\n"+
"1. Press F9 to open the Train Operations window.\n"+
"2. Double-click a unit in the part of the train you want to uncouple from the locomotive, to set the handbrake.\n"+
"3. Double-click the coupler between the units you want to uncouple and the rest of the train.\n"+
"4. Close the Train Operations window.\n\n"+
"Firing commands (Automatic Fireman OFF in Options screen)\n"+
"To add coal to the firebox\n"+
"1. Press the F key to open the Firebox door.\n"+
"2. Press the R key to increase the shoveling rate.\n\n"+
"To stop adding coal to the fire\n"+
"1. Press SHIFT+R to decrease the shoveling rate.\n"+
"2. Press SHIFT+F to close the firebox door.\n\n"+
"To operate the blower\n"+
"1.Press the N key to increase the blower.\n"+
"2. Press SHIFT+N to decrease the blower.\n\n"+
"To operate the dampers\n"+
"1.Press the M key to open the dampers.\n"+
"2. Press SHIFT+M to close the dampers.\n\n"+
"To inject water into the boiler\n"+
"1.Press the I key to turn on the steam to Injector 1.\n"+
"(You can also press the O key to turn on the steam to Injector 2.)\n"+
"2.Press the K key to increase the water flow to Injector 1.\n"+
"(To increase the water flow to Injector 2, press the L key.)\n\n"+
"To stop boiler water injection\n"+ 
"1. Press the I key to turn off the steam to Injector 1.\n"+
"2. Press the O key to turn off the steam to Injector 2."
)
)